app/services/story_service.rb

SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = 6 LIMIT 1
---
  def initialize(params)
    @story = Story.new(params['story'])
  	if params['id']
      @story = Story.find(params['id'])