app/views/stories/_form.html.erb

            <%= form.label :writer %>
            <%= form.select :writer_id, User.where(role: 'writer').collect {|x| [x.name, x.id]}, :include_blank => true %>
---
SELECT `users`.* FROM `users` WHERE `users`.`role` = 'writer'

            <%= form.label :reviewer %>
            <%= form.select :reviewer_id, User.where(role: 'writer').collect {|x| [x.name, x.id]}, :include_blank => true %>
---
SELECT `users`.* FROM `users` WHERE `users`.`role` = 'writer'