app/controllers/comments_controller.rb

SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `story_id`, `created_at`, `updated_at`) VALUES ('Joseph', 'first comment', 1, '2019-06-16 00:46:02', '2019-06-16 00:46:02')
UPDATE `stories` SET `status` = 'in_review' WHERE `stories`.`id` = 3
---
  def create
    @story = Story.find(params[:story_id])
    @comment = @story.comments.create(comment_params)

    next_state = StoryStateService.new(@story, current_user, 'comment').call

    if next_state
      @story.update_column(:status, next_state)