app/controllers/stories_controller.rb

SELECT `stories`.* FROM `stories`
---
  def index
    @search = Story.search(params[:q])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @story = Story.find(params[:id])

SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
---
  def show
    @story = Story.find(params[:id])

INSERT INTO `stories` (`headline`, `body`, `creator_id`, `writer_id`, `reviewer_id`, `created_at`, `updated_at`) VALUES ('Story 2 Headline', 'danidajndaisodnaoidjansdisan', 1, 2, 3, '2019-06-15 23:41:44', '2019-06-15 23:41:44')
---
  def create
    @story = Story.new(story_params)
    @story.creator = current_user

    if @story.save

SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = 3 LIMIT 1
UPDATE `stories` SET `status` = 'draft' WHERE `stories`.`id` = 13
UPDATE `stories` SET `body` = 'Testando caminho perfeito viu', `updated_at` = '2019-06-16 21:10:36' WHERE `stories`.`id` = 6
---
  def update
    @story = Story.find(params[:id])

    if @story.update(story_params)

      next_state = StoryStateService.new(@story, current_user, nil).call

      if next_state
        @story.update_column(:status_id, next_state)

SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = 6 LIMIT 1
UPDATE `stories` SET `status` = 'for_review' WHERE `stories`.`id` = 3
---
  def update_story_status_event
    story = Story.find(params['story_id'])
    sub_action = params['sub_action']

    next_state = StoryStateService.new(story, current_user, sub_action).call

    if next_state
      story.update_column(:status_id, next_state)